[
  {
    "title": "Excited to Share: Sneak Peek of My Latest PWA Project!",
    "description": "Hey everyone! 👋 I wanted to give you a quick glimpse into the Progressive Web App (PWA) I'm currently working on. Check out this short video showcasing the awesome features I've been implementing!I've integrated Microsoft Graph for seamless login functionality, allowing users to securely access the app with ease. Plus, I'm utilizing React Viewer to dynamically generate and display PDFs within the app. And the best part? Everything is automatically saved to OneDrive for convenient access and storage.This project has been a thrilling journey so far, and I can't wait to share more updates with you soon. Stay tuned for more behind-the-scenes peeks and progress reports!Watch the video here: [insert link to video]#PWA #MicrosoftGraph #ReactViewer #OneDrive #WebDevelopment #ProgressUpdate",
    "Img": "15.png",
    "GitHubLinkFront": "https://github.com/DiegoDimitroffPetcoff/INDIRE-PWA",
    "GitHubLinkBack": "",
    "iframe": "https://www.linkedin.com/embed/feed/update/urn:li:ugcPost:7180550065218797568",
    "DeployLink": "https://indire-portugal.vercel.app/",
    "date": "04/03/24"
  },
  {
    "title": "Indire Project - Full Stack development (React Js + PWF + Microsoft Graph)",
    "description": "New project in development! This is an application that will be used by a company specializing in building renovations. In this case, the client's need to address is to optimize the analysis process they undertake for new projects, thereby streamlining the work currently required to describe and detail all the tasks for a new client. With this application, the client will be able to create new projects, which will serve to detail all the work required for their clients (the renovations needed in specific buildings). They will also have the ability to streamline the creation of detailed budgets for each section to be developed, generate PDF and WORD documents from them, and automate saving them directly to their ONEDRIVE account. This project has the interesting feature of being developed solely on the frontend with JavaScript and using OneDrive (in a manner of speaking) as a database, as all documents will be saved automatically. The entire project will be formatted as a PWA with the goal of being usable on Android devices and PCs initially. The application will work both offline and online, so that information created is saved, and when reconnected, changes are compared with those currently stored to update appropriately..",
    "Img": "15.png",
    "GitHubLinkFront": "https://github.com/DiegoDimitroffPetcoff/INDIRE-PWA",
    "GitHubLinkBack": "",
    "iframe": "",
    "DeployLink": "https://indire-portugal.vercel.app/",
    "date": "17/01/24"
  },
  {
    "title": "Zuca Arq Project - Full Stack development (stack MERN + Claudinary)",
    "description": "I am happy to be able to start working with some new ventures that are looking to go on the market! On this occasion I started working for the ZUCA brand, which is located in Argentina - Chaco. In this case my development is carried out in FULL STACK mode. Although the project is still in development, I am proud to present a small preview of it. In this case I have done everything myself, both the Backend and the Fronted part. Regarding the code that you see in the backend... I am using two different projects, in the case of the login I use a job that I have created previously. As for the CRUD of the project... I use a new job that I generated specifically for this job. From the Frontend I started to use REDUX to work with the login and generate the global state of the application. As for the database, use MongooDb and the images are stored in cloudinary. They are rendered automatically if they are created or deleted. The back is deployed in Render.com, which has the particularity of being a bit slow every time an HTTP request is sent from the front (this happens because obviously the server is not activated at all times). To try to lessen this problem a bit, automatically place an action with AXIOS in order to perform a GET request only in order to activate the server in Render (in case it is not already active) and thus reduce the time a bit. waiting to receive information from it (of course this happens because I am using a free host... if it was paid I would not need to do it) The front is deployed on Vercel which offers an excellent free service. The web design was done by myself...following the color patterns requested by the client. An interesting question to take into account is that the project is designed so that only the administrator can have access to the Login... that is to say that it does not have a \"LOGIN\" button itself... for this we must go to the route \"/login\" manually to access it... and enter the credentials that I as a programmer offer to the client. Then, when logged in, he will be able to access a dashboard to add or remove projects with images or edit his personal information. At the moment the project is in development but I hope to finish it this week. Until then, I'll leave you the code that I'm developing and the deployed project so you can take a look! :)",
    "Img": "11.png",
    "GitHubLinkFront": "https://github.com/DiegoDimitroffPetcoff/ZucaBranch",
    "GitHubLinkBack": "https://github.com/DiegoDimitroffPetcoff/zucaArq",
    "iframe": "",
    "DeployLink": "https://zucaarct.vercel.app/",
    "date": "22/05/23"
  },

  {
    "title": "Migrating from a static project to a scalable one in React",
    "description": "In this article, I will present my new project built in React, showcase the previous one and compare the two websites that I have constructed to observe the differences in technologies and design. The new site, https://diegodimitroffpetcoff-f5qv9vv5a-diegodimitroffpetcoff.vercel.app/, is a React application with reusable components, while the old website, https://diegodimitroffpetcoff.github.io/Porfolio/, is a static page built with HTML, CSS, and JavaScript. Although both options are valid for building websites, it is interesting to see how different technologies have been used for each project. In terms of design, the new website has a more minimalist style and uses a softer color palette, while the old website uses more vibrant colors. Of course, I have found some preferences and that is why I decided to make modifications in the new project. I can say that the differences in design may be due to the nature of each project, with the first website being more focused on simplicity and functionality, and the second website being more focused on visual design. In terms of file structure, the new website uses a typical folder and file structure of a React application, while the second website has all its files at the root of the GitHub repository. My intention with this is to reflect my evolution as a developer over time and how I have learned to structure my projects more efficiently. In conclusion, comparing two built websites can be an excellent way to observe differences in technologies, design, and file structure. Although each project is unique and should be built with its own needs in mind, observing how other developers build their websites can provide valuable ideas and knowledge for our own work. I hope you have time to browse my portfolio and see my work!",
    "Img": "10.png",
    "GitHubLinkFront": "",
    "GitHubLinkBack": "",
    "iframe": "https://diegodimitroffpetcoff.github.io/Porfolio/",
    "DeployLink": "https://diegodimitroffpetcoff-f5qv9vv5a-diegodimitroffpetcoff.vercel.app/",
    "date": "28/04/23"
  },
  {
    "title": "ITenseno Project",
    "description": "is last month I found myself working very hard on the latest edition of the No Country internship. We started to carry out this super interesting project! An application aimed at IT students who want to learn and teach!! In this case I make a sample of the work done from the   back with Postman. You can see the responses that the API offers. Check a short video about this project I shared here a little of the work of the last month. In this case, the videos are in their Spanish version and I show the features of the API that I was working on",
    "Img": "14.png",
    "GitHubLinkFront": "",
    "GitHubLinkBack": "",
    "iframe": "",
    "DeployLink": "https://c13-13-n-node-react-n72y.vercel.app/",
    "date": "11/12/22"
  },
  {
    "title": "Migration from Heroku app to Railway",
    "description": "This is my first article written from my linkedin account. My intention is to tell a little about the process of migrating from a tool like Heroku to a new one that can currently be used for free!",
    "Img": "",
    "GitHubLinkFront": "",
    "GitHubLinkBack": "",
    "iframe": "https://www.linkedin.com/embed/feed/update/urn:li:ugcPost:7008750196180316160",
    "DeployLink": "",
    "date": "15/12/22"
  }
]
